papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/perpendicularFlap/base/partitioned/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
fluidSolidInterface IQNILS;

"fixedRelaxationCoeffs|AitkenCoeffs|IQNILSCoeffs"
{
    solidPatch      interface;
    fluidPatch      flap;
    relaxationFactor 0.1;
    outerCorrTolerance 0.001;
    nOuterCorr      100;
    additionalMeshCorrection yes;
    incrementalResiduals no;
    coupled         yes;
    interfaceTransferMethod directMap;
    writeResidualsToFile yes;
}

// ************************************************************************* //
